import 'package:flutter/material.dart';

class ListView2 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: "ListView EP2",
      home: Scaffold(
        appBar: AppBar(
          title: Text("ListView EP2"),
        ),
        body: ListView(
          children: <Widget>[
            ListTile(
              leading: Icon(Icons.directions_railway),
              title: Text("08.00"),
              subtitle: Text(
                  "คอมเมนท์ป่าไม้ดีมานด์บอยคอตต์มหภาค แอสเตอร์ ผลไม้ทอร์นาโด โอเค พูลรีวิวแกงค์รีโมทบิ๊ก สต็อคเมจิคมอยส์เจอไรเซอร์เยอร์บีร่า บร็อกโคลี ซ้อโปรเจ็กต์สแตนเลสกรุ๊ป แอ๊บแบ๊ว สมิติเวชสะบึมมาร์จิน พาร์ตเนอร์เพลซธุรกรรม มาม่าเธคคาแรคเตอร์เอ็นเตอร์เทน คอร์รัปชั่นกลาส มินต์เซ็นเตอร์เก๊ะแชมเปี้ยนเทอร์โบ กาญจนาภิเษก คอนเซ็ปต์เบลอแดนเซอร์"),
              trailing: Icon(Icons.notifications),
              onTap: () {
                print("click");
              },
            ),
            ListTile(
              leading: Icon(Icons.directions_car),
              title: Text("09.00"),
              subtitle: Text(
                  "คอมเมนท์ป่าไม้ดีมานด์บอยคอตต์มหภาค แอสเตอร์ ผลไม้ทอร์นาโด โอเค พูลรีวิวแกงค์รีโมทบิ๊ก สต็อคเมจิคมอยส์เจอไรเซอร์เยอร์บีร่า บร็อกโคลี ซ้อโปรเจ็กต์สแตนเลสกรุ๊ป แอ๊บแบ๊ว สมิติเวชสะบึมมาร์จิน พาร์ตเนอร์เพลซธุรกรรม มาม่าเธคคาแรคเตอร์เอ็นเตอร์เทน คอร์รัปชั่นกลาส มินต์เซ็นเตอร์เก๊ะแชมเปี้ยนเทอร์โบ กาญจนาภิเษก คอนเซ็ปต์เบลอแดนเซอร์"),
              trailing: Icon(Icons.notifications),
              selected: true,
            ),
            ListTile(
              leading: Icon(Icons.directions_boat),
              title: Text("10.00"),
              subtitle: Text(
                  "คอมเมนท์ป่าไม้ดีมานด์บอยคอตต์มหภาค แอสเตอร์ ผลไม้ทอร์นาโด โอเค พูลรีวิวแกงค์รีโมทบิ๊ก สต็อคเมจิคมอยส์เจอไรเซอร์เยอร์บีร่า บร็อกโคลี ซ้อโปรเจ็กต์สแตนเลสกรุ๊ป แอ๊บแบ๊ว สมิติเวชสะบึมมาร์จิน พาร์ตเนอร์เพลซธุรกรรม มาม่าเธคคาแรคเตอร์เอ็นเตอร์เทน คอร์รัปชั่นกลาส มินต์เซ็นเตอร์เก๊ะแชมเปี้ยนเทอร์โบ กาญจนาภิเษก คอนเซ็ปต์เบลอแดนเซอร์"),
              trailing: Icon(Icons.notifications),
              enabled: false,
            ),
            ListTile(
              leading: Icon(Icons.directions_bike),
              title: Text("11.00"),
              subtitle: Text(
                  "คอมเมนท์ป่าไม้ดีมานด์บอยคอตต์มหภาค แอสเตอร์ ผลไม้ทอร์นาโด โอเค พูลรีวิวแกงค์รีโมทบิ๊ก สต็อคเมจิคมอยส์เจอไรเซอร์เยอร์บีร่า บร็อกโคลี ซ้อโปรเจ็กต์สแตนเลสกรุ๊ป แอ๊บแบ๊ว สมิติเวชสะบึมมาร์จิน พาร์ตเนอร์เพลซธุรกรรม มาม่าเธคคาแรคเตอร์เอ็นเตอร์เทน คอร์รัปชั่นกลาส มินต์เซ็นเตอร์เก๊ะแชมเปี้ยนเทอร์โบ กาญจนาภิเษก คอนเซ็ปต์เบลอแดนเซอร์"),
              trailing: Icon(Icons.notifications),
            )
          ],
        ),
      ),
    );
  }
}
