import 'package:flutter/material.dart';

class ListView1 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: "ListViewEP1",
      home: Scaffold(
        appBar: AppBar(
          title: Text("ListView EP1"),
        ),
        body: Padding(
          padding: const EdgeInsets.all(30),
          child: ListView(
            children: <Widget>[
              FlutterLogo(
                size: 100,
              ),
              Container(
                margin: EdgeInsets.only(top: 20,bottom: 15),
                child: Text(
                  "Hader",
                  style: TextStyle(fontSize: 30),
                  textAlign: TextAlign.center,
                ),
              ),
              Text("ผลักดันสี่แยกแฮมเบอร์เกอร์เทรดมือถือ เซ็นทรัลดีพาร์ตเมนต์แคมปัสฟลุตอยุติธรรม ตรวจสอบเทปสจ๊วตเช็ก ตาปรือไฟลต์คอลัมนิสต์ ใช้งานโปรเจกเตอร์เมเปิลพลาซ่าสตรอเบอร์รี รัมฟลอร์เซ่นไหว้สตรอว์เบอร์รี โต๋เต๋ช็อปรีไซเคิลคาแร็คเตอร์ ฮาราคีรีพฤหัส ซิตี เบิร์ดคอลัมน์เพลซ แครกเกอร์มาร์เก็ตสปอต อุรังคธาตุเอาท์โบว์ลิ่ง เสกสรรค์ดิสเครดิตคอร์รัปชันโฮลวีตเพาเวอร์ เที่ยงวันสกาย สหรัฐแบดลิมิต โทรรีสอร์ตฮิปโปสเตอริโอสัมนา \n\n\n"
                  "ผลักดันสี่แยกแฮมเบอร์เกอร์เทรดมือถือ เซ็นทรัลดีพาร์ตเมนต์แคมปัสฟลุตอยุติธรรม ตรวจสอบเทปสจ๊วตเช็ก ตาปรือไฟลต์คอลัมนิสต์ ใช้งานโปรเจกเตอร์เมเปิลพลาซ่าสตรอเบอร์รี รัมฟลอร์เซ่นไหว้สตรอว์เบอร์รี โต๋เต๋ช็อปรีไซเคิลคาแร็คเตอร์ ฮาราคีรีพฤหัส ซิตี เบิร์ดคอลัมน์เพลซ แครกเกอร์มาร์เก็ตสปอต อุรังคธาตุเอาท์โบว์ลิ่ง เสกสรรค์ดิสเครดิตคอร์รัปชันโฮลวีตเพาเวอร์ เที่ยงวันสกาย สหรัฐแบดลิมิต โทรรีสอร์ตฮิปโปสเตอริโอสัมนา \n\n\n"
                  "ผลักดันสี่แยกแฮมเบอร์เกอร์เทรดมือถือ เซ็นทรัลดีพาร์ตเมนต์แคมปัสฟลุตอยุติธรรม ตรวจสอบเทปสจ๊วตเช็ก ตาปรือไฟลต์คอลัมนิสต์ ใช้งานโปรเจกเตอร์เมเปิลพลาซ่าสตรอเบอร์รี รัมฟลอร์เซ่นไหว้สตรอว์เบอร์รี โต๋เต๋ช็อปรีไซเคิลคาแร็คเตอร์ ฮาราคีรีพฤหัส ซิตี เบิร์ดคอลัมน์เพลซ แครกเกอร์มาร์เก็ตสปอต อุรังคธาตุเอาท์โบว์ลิ่ง เสกสรรค์ดิสเครดิตคอร์รัปชันโฮลวีตเพาเวอร์ เที่ยงวันสกาย สหรัฐแบดลิมิต โทรรีสอร์ตฮิปโปสเตอริโอสัมนา")
            ],
          ),
        ),
      ),
    );
  }
}
